# Pandas Operations

In [1]:
# Importing the pandas library
import pandas as pd

print("Successfully imported pandas")

Successfully imported pandas

In [2]:
# Create a dataframe
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

# Print the first five rows of the df
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Info on unique values

In [3]:
# Checking the unique values in column 2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
# Checking the number of unique values in column 2
df["col2"].nunique()

3

In [5]:
# Getting the count of the unique values in columns values
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Applying functions on dataframe

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
# Function definition to apply to above dataframe
def times2(x):
    return x*x

In [8]:
df["col1-2"] = df["col1"].apply(times2)
df

   col1  col2 col3  col1-2
0     1   444  abc       1
1     2   555  def       4
2     3   666  ghi       9
3     4   444  xyz      16

In [9]:
# using lambda function 
df["count_col3"]= df["col3"].apply(lambda x: len(x))
df

   col1  col2 col3  col1-2  count_col3
0     1   444  abc       1           3
1     2   555  def       4           3
2     3   666  ghi       9           3
3     4   444  xyz      16           3

In [10]:
# Calculating the length of the 3rd column
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
# Calculating the sum of col1
df["col1"].sum()

10

## Removing column from the dataframe permanently

In [12]:
# Using del command 
del df["count_col3"]
df

   col1  col2 col3  col1-2
0     1   444  abc       1
1     2   555  def       4
2     3   666  ghi       9
3     4   444  xyz      16

In [13]:
# using drop command
df.drop("col1-2", axis = 1, inplace = True)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Getting the column names and the index range

In [14]:
# Retriving the names of all the columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
# Getting the range of index
df.index

RangeIndex(start=0, stop=4, step=1)

## Pivot-table

In [16]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [17]:
df.pivot_table(values = "D", index = ["A", "B"], columns = ["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN